using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Annual_faculty_promotions.Core.Enums
{
    public enum FurtherInformationType
    {

        مامور_به_تحصیل_در_مقطع_دکتری_داخل_یا_خارج=1,
        نوع_همکاری_نیمه_وقت_بدون_هیچگونه_ارتباط_با_سایر_دانشگاهها = 2,
        نوع_همکاری_تمام_وقت_اما_بازنشسته_از_سایردانشگاههای_وابسته=3,        
        نوع_همکاری_نیمه_وقت_اما_به_صورت_تمام_وقت_شاغل_در_سایر_دانشگاهها_با_ارائه_حکم_کارگزینی_مبنی_بر_اعطای_پایه_سالیانه_دردانشگاه_دولتی=4,
        حکم_بازنشستگی_و_اخذ_مجوز_از_سازمان_مرکزی_دانشگاه_آزاد=5,
        نوع_همکاری_تمام_وقت_اما_غیر_بازنشسته_در_صورت_استفاء=6,
        مستندات_آزادگان_اسرا_مفقودین=7,
        مستندات_جانبازی=8,
        مستندات_رزمنده = 9,
        گواهی_دوره_پسا_دکترا=10,
        مجوز_سازمان_مرکزی_برای_فرصت_مطالعاتی=11,
        مستندات_کتاب_مقاله_کنفرانس_طرح_پژوهشی=12
    }
}
